doc/engines/graph.dot
digraph G {
  compound=true;
  subgraph cluster0 {
    app [shape=box];
  }
  subgraph cluster1 {
    label = "core";
    "core" [shape=ellipse];
  };
  subgraph cluster2 {
    label = "data";
    "users" [shape=ellipse];
    "organizations" [shape=ellipse];
    "organizations" -> "users" [color=grey];
    "address_book" [shape=ellipse];
    "address_book" -> "core" [color=grey];
    "address_book" -> "organizations" [color=grey];
    "legacy" [shape=ellipse];
    "legacy" -> "core" [color=grey];
    "legacy" -> "profiles" [color=grey];
    "legacy" -> "organizations" [color=grey];
    "legacy" -> "quotations" [color=grey];
    "companies" [shape=ellipse];
    "companies" -> "organizations" [color=grey];
    "companies" -> "legacy" [color=grey];
    "companies" -> "groups" [color=grey];
    "groups" [shape=ellipse];
    "groups" -> "organizations" [color=grey];
    "groups" -> "companies" [color=grey];
    "routing" [shape=ellipse];
    "routing" -> "core" [color=grey];
    "routing" -> "legacy" [color=grey];
    "sequential" [shape=ellipse];
    "sequential" -> "core" [color=grey];
    "cms_data" [shape=ellipse];
    "cms_data" -> "organizations" [color=grey];
    "booking" [shape=ellipse];
    "booking" -> "companies" [color=grey];
    "booking" -> "organizations" [color=grey];
    "booking" -> "users" [color=grey];
    "booking" -> "legacy" [color=grey];
    "tenant_routing" [shape=ellipse];
    "tenant_routing" -> "core" [color=grey];
    "tenant_routing" -> "routing" [color=grey];
    "tenant_routing" -> "organizations" [color=grey];
    "ledger" [shape=ellipse];
    "ledger" -> "cargo" [color=grey];
    "ledger" -> "core" [color=grey];
    "ledger" -> "routing" [color=grey];
    "ledger" -> "tenant_routing" [color=grey];
    "ledger" -> "organizations" [color=grey];
    "ledger" -> "legacy" [color=grey];
    "rates" [shape=ellipse];
    "rates" -> "cargo" [color=grey];
    "rates" -> "organizations" [color=grey];
    "rates" -> "routing" [color=grey];
    "rms_data" [shape=ellipse];
    "rms_data" -> "core" [color=grey];
    "rms_data" -> "organizations" [color=grey];
  };
  subgraph cluster3 {
    label = "view";
    "admiralty_assets" [shape=ellipse];
    "admiralty_assets" -> "core" [color=grey];
    "admiralty_auth" [shape=ellipse];
    "admiralty_auth" -> "admiralty_assets" [color=grey];
    "admiralty_auth" -> "core" [color=grey];
    "admiralty_reports" [shape=ellipse];
    "admiralty_reports" -> "admiralty_assets" [color=grey];
    "admiralty_reports" -> "admiralty_auth" [color=grey];
    "admiralty_reports" -> "companies" [color=grey];
    "admiralty_reports" -> "core" [color=grey];
    "admiralty_reports" -> "quotations" [color=grey];
    "admiralty_reports" -> "organizations" [color=grey];
    "admiralty_reports" -> "organization_manager" [color=grey];
    "admiralty_tenants" [shape=ellipse];
    "admiralty_tenants" -> "admiralty_assets" [color=grey];
    "admiralty_tenants" -> "admiralty_auth" [color=grey];
    "admiralty_tenants" -> "authentication" [color=grey];
    "admiralty_tenants" -> "core" [color=grey];
    "admiralty_tenants" -> "legacy" [color=grey];
    "admiralty_tenants" -> "pricings" [color=grey];
    "admiralty_tenants" -> "profiles" [color=grey];
    "admiralty_tenants" -> "organizations" [color=grey];
    "admiralty_tenants" -> "organization_manager" [color=grey];
    "admiralty_tenants" -> "users" [color=grey];
    "admiralty" [shape=ellipse];
    app -> "admiralty"
    "admiralty" -> "admiralty_assets" [color=grey];
    "admiralty" -> "admiralty_auth" [color=grey];
    "admiralty" -> "admiralty_reports" [color=grey];
    "admiralty" -> "admiralty_tenants" [color=grey];
    "admiralty" -> "core" [color=grey];
    "admiralty" -> "legacy" [color=grey];
    "admiralty" -> "quotations" [color=grey];
    "admiralty" -> "shipments" [color=grey];
    "admiralty" -> "organizations" [color=grey];
    "admiralty" -> "organization_manager" [color=grey];
    "api_auth" [shape=ellipse];
    "api_auth" -> "core" [color=grey];
    "api_auth" -> "users" [color=grey];
    "api_auth" -> "organizations" [color=grey];
    "api_auth" -> "authentication" [color=grey];
    "api" [shape=ellipse];
    app -> "api"
    "api" -> "analytics" [color=grey];
    "api" -> "api_auth" [color=grey];
    "api" -> "authentication" [color=grey];
    "api" -> "cargo" [color=grey];
    "api" -> "core" [color=grey];
    "api" -> "organizations" [color=grey];
    "api" -> "organization_manager" [color=grey];
    "api" -> "pricings" [color=grey];
    "api" -> "profiles" [color=grey];
    "api" -> "result_formatter" [color=grey];
    "api" -> "cms_data" [color=grey];
    "api" -> "trucking" [color=grey];
    "api" -> "users" [color=grey];
    "api" -> "wheelhouse" [color=grey];
    "idp" [shape=ellipse];
    "idp" -> "authentication" [color=grey];
    "idp" -> "organization_manager" [color=grey];
    "idp" -> "organizations" [color=grey];
    "idp" -> "profiles" [color=grey];
  };
  subgraph cluster4 {
    label = "service";
    "profiles" [shape=ellipse];
    "profiles" -> "core" [color=grey];
    "profiles" -> "users" [color=grey];
    "profiles" -> "organizations" [color=grey];
    "organization_manager" [shape=ellipse];
    "organization_manager" -> "organizations" [color=grey];
    "organization_manager" -> "groups" [color=grey];
    "organization_manager" -> "companies" [color=grey];
    "cargo" [shape=ellipse];
    "cargo" -> "core" [color=grey];
    "cargo" -> "organizations" [color=grey];
    "cargo" -> "organization_manager" [color=grey];
    "cargo" -> "legacy" [color=grey];
    "quotations" [shape=ellipse];
    "quotations" -> "cargo" [color=grey];
    "quotations" -> "core" [color=grey];
    "quotations" -> "legacy" [color=grey];
    "quotations" -> "organizations" [color=grey];
    "authentication" [shape=ellipse];
    "authentication" -> "organizations" [color=grey];
    "authentication" -> "organization_manager" [color=grey];
    "authentication" -> "users" [color=grey];
    "authentication" -> "groups" [color=grey];
    "locations" [shape=ellipse];
    "locations" -> "core" [color=grey];
    "trucking" [shape=ellipse];
    "trucking" -> "core" [color=grey];
    "trucking" -> "legacy" [color=grey];
    "trucking" -> "locations" [color=grey];
    "trucking" -> "organizations" [color=grey];
    "pricings" [shape=ellipse];
    "pricings" -> "companies" [color=grey];
    "pricings" -> "core" [color=grey];
    "pricings" -> "groups" [color=grey];
    "pricings" -> "legacy" [color=grey];
    "pricings" -> "organizations" [color=grey];
    "pricings" -> "organization_manager" [color=grey];
    "pricings" -> "trucking" [color=grey];
    "shipments" [shape=ellipse];
    "shipments" -> "address_book" [color=grey];
    "shipments" -> "cargo" [color=grey];
    "shipments" -> "core" [color=grey];
    "shipments" -> "quotations" [color=grey];
    "shipments" -> "routing" [color=grey];
    "shipments" -> "sequential" [color=grey];
    "shipments" -> "organizations" [color=grey];
    "analytics" [shape=ellipse];
    "analytics" -> "companies" [color=grey];
    "analytics" -> "legacy" [color=grey];
    "analytics" -> "organizations" [color=grey];
    "analytics" -> "organization_manager" [color=grey];
    "analytics" -> "pricings" [color=grey];
    "analytics" -> "quotations" [color=grey];
    "analytics" -> "shipments" [color=grey];
    "result_formatter" [shape=ellipse];
    "result_formatter" -> "legacy" [color=grey];
    "result_formatter" -> "pricings" [color=grey];
    "result_formatter" -> "quotations" [color=grey];
    "offer_calculator" [shape=ellipse];
    "offer_calculator" -> "core" [color=grey];
    "offer_calculator" -> "legacy" [color=grey];
    "offer_calculator" -> "organizations" [color=grey];
    "offer_calculator" -> "organization_manager" [color=grey];
    "offer_calculator" -> "pricings" [color=grey];
    "offer_calculator" -> "quotations" [color=grey];
    "offer_calculator" -> "result_formatter" [color=grey];
    "offer_calculator" -> "trucking" [color=grey];
    "pdf" [shape=ellipse];
    "pdf" -> "core" [color=grey];
    "pdf" -> "legacy" [color=grey];
    "pdf" -> "pricings" [color=grey];
    "pdf" -> "profiles" [color=grey];
    "pdf" -> "quotations" [color=grey];
    "pdf" -> "organizations" [color=grey];
    "pdf" -> "organization_manager" [color=grey];
    "wheelhouse" [shape=ellipse];
    "wheelhouse" -> "cargo" [color=grey];
    "wheelhouse" -> "core" [color=grey];
    "wheelhouse" -> "legacy" [color=grey];
    "wheelhouse" -> "offer_calculator" [color=grey];
    "wheelhouse" -> "pdf" [color=grey];
    "wheelhouse" -> "organizations" [color=grey];
    "wheelhouse" -> "organization_manager" [color=grey];
    "federation" [shape=ellipse];
    "federation" -> "core" [color=grey];
    "federation" -> "organizations" [color=grey];
    "helmsman" [shape=ellipse];
    "helmsman" -> "core" [color=grey];
    "helmsman" -> "federation" [color=grey];
    "helmsman" -> "ledger" [color=grey];
    "helmsman" -> "routing" [color=grey];
    "helmsman" -> "tenant_routing" [color=grey];
    "helmsman" -> "organizations" [color=grey];
    "helmsman" -> "organization_manager" [color=grey];
    "helmsman" -> "companies" [color=grey];
    "helmsman" -> "legacy" [color=grey];
    "integrations" [shape=ellipse];
    "integrations" -> "organization_manager" [color=grey];
    "integrations" -> "companies" [color=grey];
    "integrations" -> "core" [color=grey];
    "integrations" -> "legacy" [color=grey];
    "integrations" -> "profiles" [color=grey];
    "integrations" -> "shipments" [color=grey];
    "migrator" [shape=ellipse];
    "migrator" -> "organizations" [color=grey];
    "migrator" -> "users" [color=grey];
    "rate_extractor" [shape=ellipse];
    "rate_extractor" -> "cargo" [color=grey];
    "rate_extractor" -> "organization_manager" [color=grey];
    "rate_extractor" -> "quotations" [color=grey];
    "rate_extractor" -> "rates" [color=grey];
    "rate_extractor" -> "routing" [color=grey];
    "rate_extractor" -> "tenant_routing" [color=grey];
    "rms_export" [shape=ellipse];
    "rms_export" -> "core" [color=grey];
    "rms_export" -> "organizations" [color=grey];
    "rms_export" -> "organization_manager" [color=grey];
    "rms_export" -> "routing" [color=grey];
    "rms_sync" [shape=ellipse];
    "rms_sync" -> "core" [color=grey];
    "rms_sync" -> "legacy" [color=grey];
    "rms_sync" -> "pricings" [color=grey];
    "rms_sync" -> "rms_data" [color=grey];
    "rms_sync" -> "routing" [color=grey];
    "rms_sync" -> "organizations" [color=grey];
    "tender_calculator" [shape=ellipse];
    "tender_calculator" -> "cargo" [color=grey];
    "tender_calculator" -> "rate_extractor" [color=grey];
    "tender_calculator" -> "rates" [color=grey];
    "tender_calculator" -> "tenant_routing" [color=grey];
    "tender_calculator" -> "quotations" [color=grey];
    "tender_calculator" -> "legacy" [color=grey];
    "validator" [shape=ellipse];
    "validator" -> "core" [color=grey];
    "validator" -> "groups" [color=grey];
    "validator" -> "legacy" [color=grey];
    "validator" -> "pricings" [color=grey];
    "validator" -> "organizations" [color=grey];
    "validator" -> "organization_manager" [color=grey];
    "validator" -> "trucking" [color=grey];
  };
}
